#a = 1
#b = 1
#c = 1
#print(a ,id(a))
#print(b ,id(b))
#print(c ,id(c))
'''Создал три переменные с одинаковыми значениями и одинаковыми id'''

#d = 1
#e = '1'
#print(d , id(d))
#print(e , id(e))
'''Создал две переменные с одинаковыми значениями и с разным id'''


# a = 1
# b = 1
# c = 1
# a = str(a)
# b = float(a)
# print('a',id(a), 'b',id(b), 'c',id(c))
#
# d = 1
# e = '1'
# e = int(e)
# print('d',id(d), 'e',id(e))
'''Поменял типы переменных чтобы у первых трех переменных id отличались, у последни двух совпадали'''


# darksouls = (input('Введите произвольную строку'))
# a = darksouls[0::2]
# b = darksouls[1::2]
# print('Введена строка :',darksouls)
# print(' ',a,'   ',b,'\n !!!')
'''Написал программу используя print и input'''

# a = int(input('Введите первое число'))
# b = int(input('Введите второе число'))
# if a == b:
#     print('Числа равны')
# elif a > b:
#     print('Первое числа больше второго')
# else:
#     print(' Отработала секция else')
'''Поработал с if,elif,else'''


# a = int(input('Введите первое число'))
# b = int(input('Введите второе число'))
# if a > 10 and b > 10:
#     print('Оба числа больше 10')
#     '''Условие 1 выполнил'''
# elif a or b > 10:
#     print('Одно из чисел больше 10')
#     '''Условие 2 выполнил'''
'''Третье условие не понял,надо больше подробностей и доделать'''


