print('Группа примеров №1')
X1 = 17 / 2 * 3 + 2
X2 = 2 + 17 / 2 * 3
X3 = 19 % 4 + 15 / 2 * 3
X4 = (15 + 6) - 10 * 4
X5 = 17 / 2 % 2 * 3 ** 3

print('Ответ :', X1)
print('Ответ :', X2)
print('Ответ :', X3)
print('Ответ :', X4)
print('Ответ :', X5)


print('Группа примеров №2')
Y1 = ((17 / 2) * 3) + 2
Y2 = 2 + ((17 / 2) * 3)
Y3 = 19 % 4 + ((15 / 2) * 3)
Y4 = (15 + 6) - (10 * 4)
Y5 = ((17 / 2) % 2) * (3 ** 3)

print('Ответ :', Y1)
print('Ответ :', Y2)
print('Ответ :', Y3)
print('Ответ :', Y4)
print('Ответ :', Y5)

print('Вывод примера №1', X1 == Y1)
print('Вывод примера №2', X2 == Y2)
print('Вывод примера №3', X3 == Y3)
print('Вывод примера №4', X4 == Y4)
print('Вывод примера №5', X5 == Y5)